---
kind: type
id: T:Autodesk.Revit.DB.ElementRecord
source: html/d0b04b59-347d-a34a-3127-053985ff2674.htm
---
# Autodesk.Revit.DB.ElementRecord

A record in the Revit database representing an element.

## Syntax (C#)
```csharp
public class ElementRecord : IDisposable
```

## Remarks
The record is used to extract basic information about an element before
 the element is fully expanded in memory.